tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'p7zip'
brew 'tree'
brew 'vim'
brew 'curl'
brew 'git'
brew 'tig'
brew 'the_silver_searcher'
brew 'go'
cask 'java'
cask 'java7'
cask 'pyenv'
cask 'google-chrome'
cask 'firefox-ja'
cask 'atom'
cask 'webstorm'
cask 'dash'
cask 'virtualbox'
cask 'sourcetree'
cask 'filezilla'
cask 'charles'
cask 'dropbox'
cask 'evernote'
cask 'slack'
cask 'appcleaner'
cask 'google-japanese-ime'
cask 'clipy'
