tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "ripgrep"
brew "codex"
brew "fish"
brew "gh"
brew "git"
brew "less"
brew "mcp-proxy"
brew "pkgconf"
brew "python-setuptools"
brew "rlwrap"
brew "source-highlight"
brew "tig"
brew "trash"
brew "tree"
brew "uv"
brew "qmk/qmk/qmk"
cask "clipy"
cask "docker-desktop"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "qwtel.sqlite-viewer"
vscode "twxs.cmake"
vscode "ziyasal.vscode-open-in-github"
